/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   signals.c                                          :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: pveeta <pveeta@student.42.fr>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/02/12 16:00:13 by pveeta            #+#    #+#             */
/*   Updated: 2022/03/07 17:56:36 by pveeta           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "minishell.h"

void	my_handler(int sig_num) // (void) ?
{
	(void)sig_num;//del???
	write(2, "\n", 1);//???
	// rl_on_new_line(); //переход на новую строку
	// rl_redisplay(); // Изменить то, что отображается на экране,
	// // чтобы отразить текущее содержимое строкового буфера

	// write(2, "\n", 1); // write(1, "  \b\b\n", 5);
	// rl_on_new_line();
	// rl_replace_line("\0", 1); //заменяет буфер на текст в кавычках
	// rl_redisplay();
}